{
  "entries": {
    "dragonborn": {
      "name": "Dragonborn",
      "description_short": "",
      "description": "Source: Player's Handbook\n\nBorn of dragons, as their name proclaims, the dragonborn walk proudly through a world that greets them with fearful incomprehension. Shaped by draconic gods or the dragons themselves, dragonborn originally hatched from dragon eggs as a unique race, combining the best attributes of dragons and humanoids. Some dragonborn are faithful servants to true dragons, others form the ranks of soldiers in great wars, and still others find themselves adrift, with no clear calling in life.\n\nAbility Score Increase. \nYour Strength score increases by 2, and your Charisma score increases by 1.\n\nAge.\nYoung dragonborn grow quickly. They walk hours after hatching, attain the size and development of a 10-year-old human child by the age of 3, and reach adulthood by 15. They live to be around 80.\n\nAlignment.\nDragonborn tend towards extremes, making a conscious choice for one side or the other between Good and Evil (represented by Bahamut and Tiamat, respectively). More side with Bahamut than Tiamat (whose non-dragon followers are mostly kobolds), but villainous dragonborn can be quite terrible indeed. Some rare few choose to devote themselves to lesser dragon deities, such as Chronepsis (Neutral), and fewer still choose to worship Io, the Ninefold Dragon, who is all alignments at once.\n\nSize.\nDragonborn are taller and heavier than humans, standing well over 6 feet tall and averaging almost 250 pounds. Your size is Medium.\n\nSpeed.\nYour base walking speed is 30 feet.\n\nDraconic Ancestry.\nYou are distantly related to a particular kind of dragon. Choose a type of dragon from the below list; this determines the damage and area of your breath weapon, and the type of resistance you gain.\n\nBreath Weapon.\nYou can use your action to exhale destructive energy. It deals damage in an area according to your ancestry. When you use your breath weapon, all creatures in the area must make a saving throw, the type of which is determined by your ancestry. The DC of this saving throw is 8 + your Constitution modifier + your proficiency bonus. A creature takes 2d6 damage on a failed save, and half as much damage on a successful one. The damage increase to 3d6 at 6th level, 4d6 at 11th, and 5d6 at 16th level. After using your breath weapon, you cannot use it again until you complete a short or long rest. HBInstead, you may use your breath weapon a number of times equal to your Constitution modifier. You regain expended uses on a short or long rest.\n\nDamage Resistance.\nYou have resistance to the damage type associated with your ancestry.\n\nLanguages.\nYou can read, speak, and write Common and Draconic.\n"
    },
    "dwarf": {
      "name": "Dwarf",
      "description_short": "",
      "description": "Source: Player's Handbook\n\nKingdoms rich in ancient grandeur, halls carved into the roots of mountains, the echoing of picks and hammers in deep mines and blazing forges, a commitment to clan and tradition, and a burning hatred of goblins and orcs – these common threads unite all dwarves.\n\nAbility Score Increase.\nYour Constitution score increases by 2.\n\nAge.\nDwarves mature at the same rate as humans, but they're considered young until they reach the age of 50. On average, they live about 350 years.\n\nAlignment.\nMost dwarves are lawful, believing firmly in the benefits of a well-ordered society. They tend toward good as well, with a strong sense of fair play and a belief that everyone deserves to share in the benefits of a just order.\n\nSize.\nDwarves stand between 4 and 5 feet tall and average about 150 pounds. Your size is Medium.\n\nSpeed.\nYour base walking speed is 25 feet. Your speed is not reduced by wearing heavy armor.\n\nDarkvision.\nAccustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n\nDwarven Resilience.\nYou have advantage on saving throws against poison, and you have resistance against poison damage.\n\nDwarven Combat Training.\nYou have proficiency with the battleaxe, handaxe, light hammer, and warhammer.\n\nTool Proficiency.\nYou gain proficiency with the artisan's tools of your choice: smith's tools, brewer's supplies, or mason's tools.\n\nStonecunning.\nWhenever you make an Intelligence (History) check related to the origin of stonework, you are considered proficient in the History skill and add double your proficiency bonus to the check, instead of your normal proficiency bonus.\n\nLanguages.\nYou can speak, read, and write Common and Dwarvish. Dwarvish is full of hard consonants and guttural sounds, and those characteristics spill over into whatever other language a dwarf might speak.\n\n\nHill Dwarf\nAs a hill dwarf, you have keen senses, deep intuition, and remarkable resilience. The gold dwarves of Faerun in their mighty southern kingdom are hill dwarves, as are the exiled Neidar and the debased Klar of Krynn in the Dragonlance setting.\n\nAbility Score Increase.\nYour Wisdom score increases by 1.\n\nDwarven Toughness.\nYour hit point maximum increases by 1, and it increases by 1 every time you gain a level.\n\n\nMountain Dwarf\nAs a mountain dwarf, you're strong and hardy, accustomed to a difficult life in rugged terrain. You're probably on the tall side (for a dwarf), and tend toward lighter coloration, The shield dwarves of northern Faerun, as well as the ruling Hylar c1an and the noble Daewar c1an of Dragonlance, are mountain dwarves.\n\nAbility Score Increase.\nYour Strength score increases by 2.\n\nDwarven Armor Training.\nYou have proficiency with light and medium armor.\n"
    },
    "elf": {
        "name": "Elf",
        "description_short": "",
        "description": "Source: Player's Handbook\n\nElves are a magical people of otherworldly grace, living in places of ethereal beauty, in the midst of ancient forests or in silvery spires glittering with faerie light, where soft music drifts through the air and gentle fragrances waft on the breeze. Elves love nature and magic, art and artistry, music and poetry.\n\nAbility Score Increase.\nYour Dexterity score increases by 2.\n\nAge.\nAlthough elves reach physical maturity at about the same age as humans, the elven understanding of adulthood goes beyond physical growth to encompass worldly experience. An elf typically claims adulthood and an adult name around the age of 100 and can live to be 750 years old.\n\nAlignment.\nElves love freedom, variety, and self-expression, so they lean strongly towards the gentler aspects of chaos. They value and protect others' freedom as well as their own, and are good more often than not. Drow are an exception; their exile into the Underdark has made them vicious and dangerous. Drow are more often evil than not.\n\nSize.\nElves range from under 5 to over 6 feet tall and have slender builds. Your size is Medium.\n\nSpeed.\nYour base walking speed is 30 feet.\n\nDarkvision.\nAccustomed to twilit forests and the night sky, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n\nFey Ancestry.\nYou have advantage on saving throws against being charmed, and magic can't put you to sleep.\n\nTrance.\nElves do not sleep. Instead they meditate deeply, remaining semi-conscious, for 4 hours a day. The Common word for this meditation is \"trance.\" While meditating, you dream after a fashion; such dreams are actually mental exercises that have become reflexive after years of practice. After resting in this way, you gain the same benefit a human would from 8 hours of sleep.\n\nKeen Senses.\nYou have proficiency in the Perception skill.\n\nLanguages.\nYou can speak, read, and write Common and Elven.\n\n\nDark Elf\nDescended from an earlier subrace of dark-skinned elves, the drow were banished from the surface world for following the goddess Lolth down the path to evil and corruption. Now they have built their own civilization in the depths of the Underdark, patterned after the Way of Lolth. Also called dark elves. The drow have black skin that resembles polished obsidian and stark white or pale yellow hair. They commonly have very pale eyes (so pale as to be mistaken for while) in shades of lilac, silver, pink, red, and blue. They lend to be smaller and thinner than most elves.\n\nDrow adventurers are rare, and the race does not exist in all worlds. Check with your Dungeon Master to see if you can play a drow character.\n\nAbility Score Increase.\nYour Charisma score increases by 1.\n\nSuperior Darkvision.\nYour darkvision has a range of 120 feet, instead of 60.\n\nSunlight Sensitivity.\nYou have disadvantage on attack rolls and Wisdom (Perception) checks that rely on sight when you, the target of the attack, or whatever you are trying to perceive is in direct sunlight.\n\nDrow Magic.\nYou know the Dancing Lights cantrip. When you reach 3rd level, you can cast the Faerie Fire spell once with this trait and regain the ability to do so when you finish a long rest. When you reach 5th level, you can cast the Darkness spell onceand regain the ability to do so when you finish a long rest. Charisma is your spellcasting ability for these spells.\n\nDrow Weapon Training.\nYou have proficiency with rapiers, shortswords, and hand crossbows.\n\n\nHigh Elf\nAs a high elf, you have a keen mind and a mastery of at least the basics of magic. In many of the worlds of D&D, there are two kinds of high elves. One type (which includes the gray elves and valley elves of Greyhawk, the Silvanesti of Dragonlance, and the sun elves of the Forgotten Realms) is haughty and reclusive, believing themselves to be superior to non-elves and even other elves. The other type (including the high elves of Greyhawk. the Qualinesti of Dragonlance, and the moon elves of the Forgotten Realms) are more common and more friendly, and often encountered among humans and other races.\n\nThe sun elves of Faerun (also called gold elves or sunrise elves) have bronze skin and hair of copper, black, or golden blood. Their eyes are golden, silver, or black. Moon elves (also called silver elves or gray elves) are much paler, with alabaster skin sometimes tinged with blue. They often have hair of silver-while, black, or blue, but various shades of blond, brown, and red are not uncommon. Their eyes are blue or green and flecked with gold.\n\nAbility Score Increase.\nYour Intelligence score increases by 1.\n\nCantrip.\nYou know one cantrip of your choice from the Wizard spell list. Intelligence is your spellcasting ability for it.\n\nElf Weapon Training.\nYou have proficiency with the longsword, shortsword, shortbow, and longbow.\n\nExtra Language.\nYou can read, speak, and write one additional language of your choice.\n\n\nWood Elf\nAs a wood elf, you have keen senses and intuition, and your fleet feet carry you quickly and stealthily through your native forests. This category includes the wild elves (grugach) of Greyhawk and the Kagonesti of Dragonlance, as well as the races called wood elves in Greyhawk and the Forgotten Realms. In Faerun, wood elves (also called wild elves. green elves, or forest elves) are reclusive and distrusting of non-elves.\n\nWood elves' skin tends to be copperish in hue, sometimes with traces of green. Their hair tends toward browns and blacks, but it is occasionally blond or copper-colored. Their eyes are green, brown, or hazel.\n\nAbility Score Increase.\nYour Wisdom score increases by 1.\n\nElf Weapon Training.\nYou have proficiency with the longsword, shortsword, shortbow, and longbow.\n\nFleet of Foot.\nYour base walking speed increases to 35 feet.\n\nMask of the Wild.\nYou can attempt to hide even when you are only lightly obscured by foliage, heavy rain, falling snow, mist, and other natural phenomena.\n"
    },
    "gnome": {
      "name": "Gnome",
      "description_short": "",
      "description": "Source: Player's Handbook\n\nA constant hum of busy activity pervades the warrens and neighborhoods where gnomes form their close-knit communities. Louder sounds punctuate the hum: a crunch of grinding gears here, a minor explosion there, a yelp of surprise or triumph, and especially bursts of laughter. Gnomes take delight in life, enjoying every moment of invention, exploration, investigation, creation, and play.\n\nAbility Score Increase.\nYour Intelligence score increases by 2.\n\nAge.\nGnomes mature at the same rate as humans, and most are expected to settle into adult life around the age of 40. They can live to 350 years on average, but it's not too uncommon for them to reach 500 years of age.\n\nAlignment.\nGnomes are generally Good. Those who tend towards Law are sages, engineers, researchers, scholars, investigators, or inventors. Those who tend towards Chaos are often minstrels, tricksters, wanderers, or fanciful jewelers. Gnomes are light-hearted, and even the tricksters amongst them favor harmless pranks over vicious schemes.\n\nSize.\nGnomes are between 3 and 4 feet tall and weigh around 40 pounds. Your size is Small.\n\nSpeed.\nYour base walking speed is 25 feet.\n\nDarkvision.\nAccustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n\nGnome Cunning.\nYou have advantage on all Intelligence, Wisdom, and Charisma saves against magic.\n\nLanguages.\nYou can read, speak, and write Common and Gnomish.\n\n\nForest\nAs a forest gnome, you have a natural knack for illusion and inherent quickness and stealth. In the worlds of D&D, forest gnomes are rare and secretive. They gather in hidden communities in sylvan forests, using illusions and trickery to conceal themselves from threats or to mask their escape should they be detected. Forest gnomes tend to be friendly with other good-spirited woodland folk, and they regard elves and good fey as their most important allies. These gnomes also befriend small forest animals and rely on them for information about threats that might prowl their lands.\n\nAbility Score Increase.\nYour Dexterity score increases by 1.\n\nNatural Illusionist.\nYou know the Minor Illusion cantrip. Intelligence is your spellcasting modifier for it.\n\nSpeak with Small Beasts.\nThrough sound and gestures, you may communicate simple ideas with Small or smaller beasts.\n\n\nRock\nAs a rock gnome, you have a natural inventiveness and hardiness beyond that of other gnomes. Most gnomes in the worlds of D&D are rock gnomes, including the tinker gnomes of the Dragonlance setting.\n\nAbility Score Increase.\nYour Constitution score increases by 1.\n\nArtificer's Lore.\nWhenever you make an Intelligence (History) check related to magical, alchemical, or technological items, you can add twice your proficiency bonus instead of any other proficiency bonus that may apply.\n\nTinker.\nYou have proficiency with artisan tools (tinker's tools). Using those tools, you can spend 1 hour and 10 gp worth of materials to construct a Tiny clockwork device (AC 5, 1 hp). The device ceases to function after 24 hours (unless you spend 1 hour repairing it to keep the device functioning), or when you use your action to dismantle it; at that time, you can reclaim the materials used to create it. You can have up to three such devices active at a time. When you create a device, choose one of the following options:\n\n  -- Clockwork Toy. This toy is a clockwork animal, monster, or person, such as a frog, mouse, bird, dragon, or soldier. When placed on the ground, the toy moves 5 feet across the ground on each of your turns in a random direction. It makes noises as appropriate to the creature it represents.\n  -- Fire Starter. The device produces a miniature flame, which you can use to light a candle, torch, or campfire. Using the device requires your action.\n  -- Music Box. When opened, this music box plays a single song at a moderate volume. The box stops playing when it reaches the song's end or when it is closed.\n  -- At your DM's discretion, you may make other objects with effects similar in power to these. The Prestidigitation cantrip is a good baseline for such effects.\n"
    },
    "half-elf": {
      "name": "Half-Elf",
      "description_short" :"",
      "description": "Source: Player's Handbook\n\nWalking in two worlds but truly belonging to neither, half-elves combine what some say are the best qualities of their elf and human parents: human curiosity, inventiveness, and ambition tempered by the refined senses, love of nature, and artistic tastes of the elves.\n\nAbility Score Increase.\nYour Charisma score increases by 2, and two other ability scores of your choice each increase by 1.\n\nAge.\nHalf-elves age at much the same rate as humans, reaching adulthood at the age of 20. They live much longer than humans, however, often exceeding 180 years.\n\nAlignment.\nHalf-elves share the chaotic bent of their elven heritage. They both value personal freedom and creative expression, demonstrating neither love of leaders nor desire for followers. They chafe at rules, resent others' demands, and sometimes prove unreliable, or at least unpredictable. They are good and evil in equal numbers, a trait they share with their human parents.\n\nSize.\nHalf-elves are more or less the same size as humans, ranging from 5 to 6 feet tall. Your size is Medium.\n\nSpeed.\nYour base walking speed is 30 feet.\n\nDarkvision.\nThanks to your elven heritage, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n\nFey Ancestry.\nYou have advantage on saving throws against being charmed, and magic can't put you to sleep.\n\nLanguages.\nYou can read, speak, and write Common, Elven, and one language of your choice.\n\nHalf-Elf Versatility.\nChoose one of the following traits:\n  -- Skill Versatility (General). You gain proficiency in two skills of your choice.\n  -- Elf Weapon Training (High or Wood Elf Heritage). You have proficiency with the longsword, shortsword, shortbow, and longbow.\n  -- Cantrip (High Elf Heritage). You know one cantrip of your choice from the wizard spell list. Intelligence is your spellcasting ability for it.\n  -- Fleet of Foot (Wood Elf Heritage). Your base walking speed increases to 35 feet.\n  -- Mask of the Wild (Wood Elf Heritage). You can attempt to hide even when you are only lightly obscured by foliage, heavy rain, falling snow, mist, and other natural phenomena.\n  -- Drow Magic (Dark Elf Heritage). You know the Dancing Lights cantrip. When you reach 3rd level, you can cast Faerie Fire once, and it recharges after a long rest. When you reach 5th level, you can cast Darkness once, and it recharges after a long rest. Charisma is your spellcasting ability for these spells.\n  -- Swim Speed (Sea Elf Heritage). You have a swimming speed of 30 feet.\n"
    },
    "half-orc": {
      "name": "Half-Orc",
      "description_short": "",
      "description": "Source: Player's Handbook\n\nWhen alliances between humans and orcs are sealed by marriages, half-orcs are born. Some half-orcs rise to become proud chiefs of orc tribes, their human blood giving them an edge over their full-blooded orc rivals. Some venture into the world to prove their worth among humans and other more civilized races. Many of these become adventurers, achieving greatness for their mighty deeds and notoriety for their barbaric customs and savage fury.\n\nAbility Score Increase.\nYour Strength score increases by 2, and your Constitution score increases by 1.\n\nAge.\nHalf-orcs mature a little faster than humans, reaching adulthood around age 14. They age noticeably faster and rarely live longer than 75 years.\n\nAlignment.\nHalf-orcs inherit a tendency toward chaos from their orc parents and are not strongly inclined toward good. Half-orcs raised among orcs and willing to live out their lives among them are usually evil.\n\nSize.\nHalf-orcs are somewhat larger and bulkier than humans, and they range from 5 to well over 6 feet tall. Your size is Medium.\n\nSpeed.\nYour base walking speed is 30 feet.\n\nDarkvision.\nThanks to your orc blood, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n\nMenacing.\nYou gain proficiency in the Intimidation skill.\n\nRelentless Endurance.\nWhen you are reduced to 0 hit points but not killed outright, you can drop to 1 hit point instead. You can't use this feature again until you finish a long rest.\n\nSavage Attacks.\nWhen you score a critical hit with a melee weapon attack, you can roll one of the weapon's damage dice one additional time and add it to the extra damage of the critical hit.\n\nLanguages.\nYou can speak, read, and write Common and Orc. Orc is a harsh, grating language with hard consonants. It has no script of its own but is written in the Dwarvish script.\n"
    },
    "halfling": {
      "name": "Halfling",
      "description_short": "",
      "description": "Source: Player's Handbook\n\nThe comforts of home are the goals of most halflings' lives: a place to settle in peace and quiet, far from marauding monsters and clashing armies. Others form nomadic bands that travel constantly, lured by the open road and the wide horizon to discover the wonders of new lands and peoples. Halflings work readily with others, and they are loyal to their friends, whether halfling or otherwise. They can display remarkable ferocity when their friends, families, or communities are threatened.\n\nAbility Score Increase.\nYour Dexterity score increases by 2.\n\nAge.\nA halfling reaches adulthood at the age of 20 and generally lives into the middle of his or her second century.\n\nAlignment.\nMost halflings are lawful good. As a rule, they are good-hearted and kind, hate to see others in pain, and have no tolerance for oppression. They are also very orderly and traditional, leaning heavily on the support of their community and the comfort of the old ways.\n\nSize.\nHalflings average about 3 feet tall and weigh about 40 pounds. Your size is small.\n\nSpeed.\nYour base walking speed is 25 feet.\n\nLucky.\nWhen you roll a 1 on an attack roll, ability check, or saving throw, you can reroll the die. You must use the new result, even if it is a 1.\n\nBrave.\nYou have advantage on saving throws against being frightened.\n\nNimble.\nYou can move through the space of any creature that is of a size larger than yours.\n\nLanguages.\nYou can speak, read, and write Common and Halfling.\n\n\nLightfoot\nAs a lightfoot halfling, you can easily hide from notice, even using other people as cover. You're inclined to be affable and get along well with others. In the Forgotten Realms, lightfoot halflings have spread the farthest and thus are the most common variety.\n\nLightfoots are more prone to wanderlust than other halflings, and often dwell alongside other races or take up a nomadic life. In the world of Grayhawk, these halflings are called hairfeet or tallfellows.\n\nAbility Score Increase.\nYour Charisma score increases by 1.\n\nNaturally Stealthy.\nYou can attempt to hide even when you are only obscured by a creature that is at least one size larger than you.\n\n\nStout\nAs a stout halfling, you're hardier than average and have some resistance to poison. Some say that stouts have dwarven blood. In the Forgotten Realms, these halflings are called stronghearts, and they're most common in the south.\n\nAbility Score Increase.\nYour Constitution score increases by 1.\n\nStout Resilience.\nYou have advantage on saving throws against poison, and you have resistance to poison damage.\n"
    },
    "human": {
      "name": "Human",
      "description_short": "",
      "description": "Source: Player's Handbook\n\nIn the reckonings of most worlds, humans are the youngest of the common races, late to arrive on the world scene and short-lived in comparison to dwarves, elves, and dragons. Perhaps it is because of their shorter lives that they strive to achieve as much as they can in the years they are given. Or maybe they feel they have something to prove to the elder races, and that's why they build their mighty empires on the foundation of conquest and trade. Whatever drives them, humans are the innovators, the achievers, and the pioneers of the worlds.\n\nAbility Score Increase.\nYour ability scores each increase by 1.\n\nAge.\nHumans reach adulthood in their late teens and live less than a century.\n\nAlignment.\nHumans tend toward no particular alignment. The best and the worst are found among them.\n\nSize.\nHumans vary widely in height and build, from barely 5 feet to well over 6 feet tall. Regardless of your position in that range, your size is Medium.\n\nSpeed.\nYour base walking speed is 30 feet.\n\nLanguages.\nYou can speak, read, and write Common and one extra language of your choice. Humans typically learn the languages of other peoples they deal with, including obscure dialects. They are fond of sprinkling their speech with words borrowed from other tongues: Orc curses, Elvish musical expressions, Dwarvish military phrases, and so on.\n\n\nVariant\nIf your campaign uses the optional feat rules from chapter 5 of the Player's Handbook, your Dungeon Master might allow these variant traits, all of which replace the human's Ability Score Increase trait.\n\nAbility Score Increase.\nTwo different ability scores of your choice increase by 1.\n\nSkills.\nYou gain proficiency in one skill of your choice.\n\nFeat.\nYou gain one feat of your choice.\n"
    },
    "tiefling": {
        "name": "Tiefling",
        "description_short": "",
        "description": "Source: Player's Handbook\n\nTo be greeted with stares and whispers, to suffer violence and insult on the street, to see mistrust and fear in every eye: this is the lot of the tiefling. And to twist the knife, tieflings know that this is because a pact struck generations ago infused the essence of Asmodeus, overlord of the Nine Hells (and many of the other powerful devils serving under him) into their bloodline. Their appearance and their nature are not their fault but the result of an ancient sin, for which they and their children and their children's children will always be held accountable.\n\nAbility Score Increase.\nYour Charisma score increases by 2.\n\nAge.\nTieflings mature at the same rate as humans but live a few years longer.\n\nAlignment.\nTieflings might not have an innate tendency toward evil, but many of them end up there. Evil or not, an independent nature inclines many tieflings toward a chaotic alignment.\n\nSize.\nTieflings are about the same size and build as humans. Your size is Medium.\n\nSpeed.\nYour base walking speed is 30 feet.\n\nDarkvision.\nThanks to your infernal heritage, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray.\n\nHellish Resistance.\nYou have resistance to fire damage.\n\nLanguages.\nYou can speak, read, and write Common and Infernal.\n\n\nBloodline of Asmodeus\nThe tieflings connected to Nessus command the power of fire and darkness, guided by a keener than normal intellect, as befits those linked to Asmodeus himself.\n\nAbility Score Increase.\nYour Intelligence score increases by 1.\n\nInfernal Legacy.\nYou know the Thaumaturgy cantrip. Once you reach 3rd level, you can cast the Hellish Rebuke spell once as a 2nd-level spell. Once you reach 5th level, you can also cast the Darkness spell once. You must finish a long rest to cast these spells again with this trait. Charisma is your spellcasting ability for these spells.\n"
    }
  }
}
